# 2. 学生信息管理项目
#   输入任意个学生的姓名,年龄,成绩.每个学生的信息存入一个字典内,然后放入到列表中
#      (每个学生需要手动输入)
#   如:
#     请输入姓名: tarena
#     请输入年龄: 20
#     请输入成绩: 99
#     请输入姓名: name2
#     请输入年龄: 30
#     请输入成绩: 88
#     请输入姓名: <回车> 结束输入
#   形成内部存储格式如下:
#     [{'name':'tarena', 'age':20, 'score':99}, {'name':name2, 'age':30, 'score':88}]
#   1) 打印出存有学生信息的字典的列表
#   2) 按表格形式打印出学生信息:
#     +---------------+----------+----------+
#     |     name      |   age    |   score  |
#     +---------------+----------+----------+
#     |    tarena     |    20    |     99   |
#     |     name2     |    30    |     88   |
#     +---------------+----------+----------+


L = []  # 创建一个新的列表，用此列表准备保存学生信息
# 录入学生信息
while True:
    n = input("请输入姓名: ")
    if not n:
        break
    a = int(input("请输入年龄: "))
    s = int(input('请输入成绩: '))
    # 创建一个新的字典，把学生的信息存入字典中
    d = {}  # 每一次都重新创建一个新的字典
    d['name'] = n
    d['age'] = a
    d['score'] = s
    L.append(d)

print(L)  # 打印结果


print("+---------------+----------+----------+")
print("|     name      |   age    |   score  |")
print("+---------------+----------+----------+")
for d in L:
    n = d['name']
    a = d['age']
    s = d['score']
    print('|%s|%s|%s|' % (n.center(15),
                          str(a).center(10),
                          str(s).center(10)
                          )
          )

# print("|    tarena     |    20    |     99   |")
# print("|     name2     |    30    |     88   |")
print("+---------------+----------+----------+")

